//
//  StringsRU.swift
//  MyHabits
//
//  Created by M M on 6/10/22.
//

import Foundation

enum StringsRU: String {
case infoHeaderRU = "Привычка за 21 день"
    case infoTextRU = """
Прохождение этапов, за которые за 21 день вырабатывается привычка, подчиняется следующему алгоритму:\n
1. Провести 1 день без обращения к старым привычкам, стараться вести себя так, как будто цель, загаданная на перспективу, находится на расстоянии шага.\n
2. Выдержать 2 дня в прежнем состоянии самоконтроля.\n
3. Отметить в дневнике первую неделю изменений и подвеёти первые итоги - что оказалось тяжело, что - легче, с чем еще предстоит серьезно бороться.\n
4. Поздравить себя с прохождением первого серьезного порога в 21 день. За это время отказ от дурных наклонностей уже примет форму осознанного преодоления и человек сможет больше работать в сторону принятия положительных качеств.\n
5. Держать планку 40 дней. Практикующий методику уже чувствует себя освободившимся от прошлого негатива и двигается в нужном направлении с хорошей динамикой.\n
6. На 90 - й день соблюдения техники все лишнее из \"прошлой жизни\" уже перестает напоминать о себе, и человек, оглянувшись назад, осознает себя полностью освободившимся.\n
Источник: psychbook.ru
"""

    //func localized() -> String { rawValue.localized() }
}
